# Dataframes en Pandas

En este tema se estudiarán los `Dataframes` al ser una herramienta muy utilizada en el análisis de datos, ya que permiten manipular y explorar grandes conjuntos de información de manera eficiente y estructurada.

El tema abordará los siguientes aspectos: 

1. [Creación de Dataframes](#creacion)
2. [Acceso a datos en Dataframes](#acceso)
3. [Añadir datos en Dataframes](#anadir)
4. [Métodos en Dataframes](#metodos)

In [1]:
# Importación de librerías
import pandas as pd
import numpy as np

/var/folders/zx/57z_g0c14095702lbtyqdbx00000gn/T/ipykernel_17938/3594924753.py:2: DeprecationWarning:
Pyarrow will become a required dependency of pandas in the next major release of pandas (pandas 3.0),
(to allow more performant data types, such as the Arrow string type, and better interoperability with other libraries)
but was not found to be installed on your system.
If this would cause problems for you,
please provide us feedback at https://github.com/pandas-dev/pandas/issues/54466

  import pandas as pd

## 1. Creación de Dataframes <a id="creacion"></a>

Vimos que podíamos crear DataFrames a raíz de un diccionario.

Índice de filas automático.

In [2]:
data = {'state': ['Ohio', 'Ohio', 'Ohio', 'Nevada', 'Nevada'],
        'year': [2000, 2001, 2002, 2001, 2002],
        'pop': [1.5, 1.7, 3.6, 2.4, 2.9]}
df = pd.DataFrame(data)
df

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9

DataFrame a partir de un diccionario de listas e índice.

In [3]:
df = pd.DataFrame({'nombre': ['Pablo', 'Teresa'],
                   'score': [22.2, 33.3]},
                  index=['pacunar', 'tono'])
df

         nombre  score
pacunar   Pablo   22.2
tono     Teresa   33.3

### 1.1. Input a través de un fichero

Vemos que al contrario que en Series, ahora no asignamos una columna ni squeeze a True.

#### a) Fichero csv

In [9]:
nba = pd.read_csv('data/nba.csv')
nba

,Name,Team,Number,Position,Age,Height,Weight,College,Salary
0,Avery Bradley,Boston Celtics,0.0,PG,25.0,6-2,180.0,Texas,7730337.0
1,Jae Crowder,Boston Celtics,99.0,SF,25.0,6-6,235.0,Marquette,6796117.0
2,John Holland,Boston Celtics,30.0,SG,27.0,6-5,205.0,Boston University,NaN
3,R.J. Hunter,Boston Celtics,28.0,SG,22.0,6-5,185.0,Georgia State,1148640.0
4,Jonas Jerebko,Boston Celtics,8.0,PF,29.0,6-10,231.0,NaN,5000000.0
...,...,...,...,...,...,...,...,...,...
453,Shelvin Mack,Utah Jazz,8.0,PG,26.0,6-3,203.0,Butler,2433333.0
454,Raul Neto,Utah Jazz,25.0,PG,24.0,6-1,179.0,NaN,900000.0
455,Tibor Pleiss,Utah Jazz,21.0,C,26.0,7-3,256.0,NaN,2900000.0
456,Jeff Withey,Utah Jazz,24.0,C,26.0,7-0,231.0,Kansas,947276.0
457,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [11]:
df = pd.read_csv('data/titanic.csv')

ParserError: Error tokenizing data. C error: Expected 4 fields in line 3, saw 6

Vemos como da un error, ya que el separador no es coma, por defecto. En este caso es `;` y debemos indicarlo.

In [13]:
df = pd.read_csv('data/titanic.csv', sep = ';')
df.head()

,pclass,survived,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked,boat,body,home.dest
0,1.0,1.0,"Allen, Miss. Elisabeth Walton",female,29,0.0,0.0,24160,"211,3375",B5,S,2,NaN,"St Louis, MO"
1,1.0,1.0,"Allison, Master. Hudson Trevor",male,"0,9167",1.0,2.0,113781,"151,5500",C22 C26,S,11,NaN,"Montreal, PQ / Chesterville, ON"
2,1.0,0.0,"Allison, Miss. Helen Loraine",female,2,1.0,2.0,113781,"151,5500",C22 C26,S,NaN,NaN,"Montreal, PQ / Chesterville, ON"
3,1.0,0.0,"Allison, Mr. Hudson Joshua Creighton",male,30,1.0,2.0,113781,"151,5500",C22 C26,S,NaN,135.0,"Montreal, PQ / Chesterville, ON"
4,1.0,0.0,"Allison, Mrs. Hudson J C (Bessie Waldo Daniels)",female,25,1.0,2.0,113781,"151,5500",C22 C26,S,NaN,NaN,"Montreal, PQ / Chesterville, ON"

#### b) Fichero excel

Vemos como en este caso no hace falta indicar el separador al tratarse de un fichero tipo xls o xlsx. Esto se debe a que los archivos Excel ya tienen un formato estructurado que Pandas puede leer sin requerir un separador explícito.

In [15]:
df_excel = pd.read_excel('data/titanic.xls')
df_excel.head()

ImportError: Missing optional dependency 'xlrd'. Install xlrd >= 2.0.1 for xls Excel support Use pip or conda to install xlrd.

#### c) Fichero json

Dependiendo del formato del fichero json, puede necesitar un preprocesamiento. Lo veremos más adelante.

In [29]:
df_json = pd.read_json('data/data.json')
df_json.head()

   Duration  Pulse  Maxpulse  Calories
0        60    110       130     409.1
1        60    117       145     479.0
2        60    103       135     340.0
3        45    109       175     282.4
4        45    117       148     406.0

### 1.2. Output a un fichero

Podemos escribir un DataFrame en un fichero, por ejemplo un `csv`.

In [31]:
data = {'state': ['Ohio', 'Ohio', 'Ohio', 'Nevada', 'Nevada'],
        'year': [2000, 2001, 2002, 2001, 2002],
        'pop': [1.5, 1.7, 3.6, 2.4, 2.9]}
df2 = pd.DataFrame(data)
df2

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9

La sintaxis es la siguiente
```python
s = df.to_csv(ruta/nombre_del_fichero.csv, index=False)
```

Si no indicamos `index = False` creará una nueva columna en el fichero con el índice del DataFrame.

In [33]:
df2.to_csv('mi_primer_df.csv', index = False)

También podemos escribirlo en un fichero excel

In [35]:
df2.to_excel('mi_primer_df.xlsx',sheet_name = "df1", index = False)

## 2. Acceso a datos en Dataframes <a id="acceso"></a>



Se pueden extraer columnas de un `DataFrame` con la etiqueta de la columna (sólo si es un identificador Python válido)  usando notación tipo diccionario o como atributo del objeto. En ambos casos se obtiene un objeto tipo `Series`.

In [39]:
df['age']  # dict type

0           29
1       0,9167
2            2
3           30
4           25
         ...
1305       NaN
1306      26,5
1307        27
1308        29
1309       NaN
Name: age, Length: 1310, dtype: object

In [41]:
df.age  # attribute type

0           29
1       0,9167
2            2
3           30
4           25
         ...
1305       NaN
1306      26,5
1307        27
1308        29
1309       NaN
Name: age, Length: 1310, dtype: object

Mediante la notación de dobles [] obtenemos un Dataframe en lugar de una Serie.

In [43]:
df[['age']]

         age
0         29
1     0,9167
2          2
3         30
4         25
...      ...
1305     NaN
1306    26,5
1307      27
1308      29
1309     NaN

[1310 rows x 1 columns]

In [17]:
type(df.age), type(df['age']), type(df[['age']])

(pandas.core.series.Series,
 pandas.core.series.Series,
 pandas.core.frame.DataFrame)

Podemos recuperar varias columnas a la vez.

In [18]:
df[['age','sex']]

         age     sex
0         29  female
1     0,9167    male
2          2  female
3         30    male
4         25  female
...      ...     ...
1305     NaN  female
1306    26,5    male
1307      27    male
1308      29    male
1309     NaN     NaN

[1310 rows x 2 columns]



Para acceder a las filas, se puede usar el atributo `loc` o la función `iloc` tal y como hacíamos en Series.

Permite acceder al contenido de un registro mediante la etiqueta del índice.

In [45]:
df = pd.DataFrame({'nombre': ['Pablo', 'Teresa'],
                   'score': [22.2, 33.3]},
                  index=['pacunar', 'tono'])
df

         nombre  score
pacunar   Pablo   22.2
tono     Teresa   33.3

In [47]:
df.loc['tono']

nombre    Teresa
score       33.3
Name: tono, dtype: object

Permite acceder al contenido de un registro mediante la posición del índice.

In [50]:
df.iloc[1]

nombre    Teresa
score       33.3
Name: tono, dtype: object

Podemos acceder a un valor concreto usando el acceso a datos visto anteriormente en Series.

In [53]:
df.iloc[1]['score']

33.3

In [55]:
df.iloc[1,1]

33.3

También podemos hacer slicing para acceder a varias filas y columnas, esta es la notación: 

```python
df.iloc[fila_inicial:fila_final, columna_inicial:columna_final]
```

In [58]:
df = pd.read_csv('data/titanic.csv', sep = ';')
df.head()

,pclass,survived,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked,boat,body,home.dest
0,1.0,1.0,"Allen, Miss. Elisabeth Walton",female,29,0.0,0.0,24160,"211,3375",B5,S,2,NaN,"St Louis, MO"
1,1.0,1.0,"Allison, Master. Hudson Trevor",male,"0,9167",1.0,2.0,113781,"151,5500",C22 C26,S,11,NaN,"Montreal, PQ / Chesterville, ON"
2,1.0,0.0,"Allison, Miss. Helen Loraine",female,2,1.0,2.0,113781,"151,5500",C22 C26,S,NaN,NaN,"Montreal, PQ / Chesterville, ON"
3,1.0,0.0,"Allison, Mr. Hudson Joshua Creighton",male,30,1.0,2.0,113781,"151,5500",C22 C26,S,NaN,135.0,"Montreal, PQ / Chesterville, ON"
4,1.0,0.0,"Allison, Mrs. Hudson J C (Bessie Waldo Daniels)",female,25,1.0,2.0,113781,"151,5500",C22 C26,S,NaN,NaN,"Montreal, PQ / Chesterville, ON"

In [60]:
df.iloc[1:5, 2:6]

                                              name     sex     age  sibsp
1                   Allison, Master. Hudson Trevor    male  0,9167    1.0
2                     Allison, Miss. Helen Loraine  female       2    1.0
3             Allison, Mr. Hudson Joshua Creighton    male      30    1.0
4  Allison, Mrs. Hudson J C (Bessie Waldo Daniels)  female      25    1.0

## 3. Añadir datos en Dataframes <a id="anadir"></a>

In [63]:
nba.head(3)

,Name,Team,Number,Position,Age,Height,Weight,College,Salary
0,Avery Bradley,Boston Celtics,0.0,PG,25.0,6-2,180.0,Texas,7730337.0
1,Jae Crowder,Boston Celtics,99.0,SF,25.0,6-6,235.0,Marquette,6796117.0
2,John Holland,Boston Celtics,30.0,SG,27.0,6-5,205.0,Boston University,NaN

Crear una columna:

In [65]:
nba["League"] = "National Basketball Association"
nba.head(3)

,Name,Team,Number,Position,Age,Height,Weight,College,Salary,League
0,Avery Bradley,Boston Celtics,0.0,PG,25.0,6-2,180.0,Texas,7730337.0,National Basketball Association
1,Jae Crowder,Boston Celtics,99.0,SF,25.0,6-6,235.0,Marquette,6796117.0,National Basketball Association
2,John Holland,Boston Celtics,30.0,SG,27.0,6-5,205.0,Boston University,NaN,National Basketball Association

Crear una columna a raíz de una nueva:

In [68]:
nba["Name_Position"] = nba["Name"] + '_' + nba["Position"]
nba.head()

,Name,Team,Number,Position,Age,Height,Weight,College,Salary,League,Name_Position
0,Avery Bradley,Boston Celtics,0.0,PG,25.0,6-2,180.0,Texas,7730337.0,National Basketball Association,Avery Bradley_PG
1,Jae Crowder,Boston Celtics,99.0,SF,25.0,6-6,235.0,Marquette,6796117.0,National Basketball Association,Jae Crowder_SF
2,John Holland,Boston Celtics,30.0,SG,27.0,6-5,205.0,Boston University,NaN,National Basketball Association,John Holland_SG
3,R.J. Hunter,Boston Celtics,28.0,SG,22.0,6-5,185.0,Georgia State,1148640.0,National Basketball Association,R.J. Hunter_SG
4,Jonas Jerebko,Boston Celtics,8.0,PF,29.0,6-10,231.0,NaN,5000000.0,National Basketball Association,Jonas Jerebko_PF

## 4. Métodos en Dataframes <a id="metodos"></a>


Vemos algunos métodos útiles de la clase Dataframe:

### 1) Métodos para extraer información de un dataframe

In [70]:
data = pd.read_csv('data/nba.csv', sep=',')
type(data)

pandas.core.frame.DataFrame

Nos indica el número de columnas y filas del dataframe:

In [73]:
data.shape

(458, 9)

In [75]:
data.values

array([['Avery Bradley', 'Boston Celtics', 0.0, ..., 180.0, 'Texas',
        7730337.0],
       ['Jae Crowder', 'Boston Celtics', 99.0, ..., 235.0, 'Marquette',
        6796117.0],
       ['John Holland', 'Boston Celtics', 30.0, ..., 205.0,
        'Boston University', nan],
       ...,
       ['Tibor Pleiss', 'Utah Jazz', 21.0, ..., 256.0, nan, 2900000.0],
       ['Jeff Withey', 'Utah Jazz', 24.0, ..., 231.0, 'Kansas', 947276.0],
       [nan, nan, nan, ..., nan, nan, nan]], dtype=object)

Devuelve una lista con el nombre de todas las columnas:

In [78]:
data.columns

Index(['Name', 'Team', 'Number', 'Position', 'Age', 'Height', 'Weight',
       'College', 'Salary'],
      dtype='object')

Devuelve los n primeros registros (5 por defecto):

In [81]:
data.head()

,Name,Team,Number,Position,Age,Height,Weight,College,Salary
0,Avery Bradley,Boston Celtics,0.0,PG,25.0,6-2,180.0,Texas,7730337.0
1,Jae Crowder,Boston Celtics,99.0,SF,25.0,6-6,235.0,Marquette,6796117.0
2,John Holland,Boston Celtics,30.0,SG,27.0,6-5,205.0,Boston University,NaN
3,R.J. Hunter,Boston Celtics,28.0,SG,22.0,6-5,185.0,Georgia State,1148640.0
4,Jonas Jerebko,Boston Celtics,8.0,PF,29.0,6-10,231.0,NaN,5000000.0

Devuelve los n últimos registros (5 por defecto):

In [84]:
data.tail(3)

,Name,Team,Number,Position,Age,Height,Weight,College,Salary
455,Tibor Pleiss,Utah Jazz,21.0,C,26.0,7-3,256.0,NaN,2900000.0
456,Jeff Withey,Utah Jazz,24.0,C,26.0,7-0,231.0,Kansas,947276.0
457,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

Devuelve un resumen estadístico de las variables:

In [87]:
data.describe(include='all') # Sin el argumento include=all sólo devolverá las columnas numéricas

,Name,Team,Number,Position,Age,Height,Weight,College,Salary
count,457,457,457.000000,457,457.000000,457,457.000000,373,4.460000e+02
unique,457,30,NaN,5,NaN,18,NaN,118,NaN
top,Avery Bradley,New Orleans Pelicans,NaN,SG,NaN,6-9,NaN,Kentucky,NaN
freq,1,19,NaN,102,NaN,59,NaN,22,NaN
mean,NaN,NaN,17.678337,NaN,26.938731,NaN,221.522976,NaN,4.842684e+06
std,NaN,NaN,15.966090,NaN,4.404016,NaN,26.368343,NaN,5.229238e+06
min,NaN,NaN,0.000000,NaN,19.000000,NaN,161.000000,NaN,3.088800e+04
25%,NaN,NaN,5.000000,NaN,24.000000,NaN,200.000000,NaN,1.044792e+06
50%,NaN,NaN,13.000000,NaN,26.000000,NaN,220.000000,NaN,2.839073e+06
75%,NaN,NaN,25.000000,NaN,30.000000,NaN,240.000000,NaN,6.500000e+06
max,NaN,NaN,99.000000,NaN,40.000000,NaN,307.000000,NaN,2.500000e+07

Devuelve un resumen de la estructura del DataFrame:

In [90]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 458 entries, 0 to 457
Data columns (total 9 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Name      457 non-null    object
 1   Team      457 non-null    object
 2   Number    457 non-null    float64
 3   Position  457 non-null    object
 4   Age       457 non-null    float64
 5   Height    457 non-null    object
 6   Weight    457 non-null    float64
 7   College   373 non-null    object
 8   Salary    446 non-null    float64
dtypes: float64(4), object(5)
memory usage: 32.3+ KB

Devuelve una lista con las etiquetas de las columnas y de las filas:

In [93]:
data.axes

[RangeIndex(start=0, stop=458, step=1),
 Index(['Name', 'Team', 'Number', 'Position', 'Age', 'Height', 'Weight',
        'College', 'Salary'],
       dtype='object')]

Devuelve el número de elementos únicos por campo:

In [96]:
data.nunique()

Name        457
Team         30
Number       53
Position      5
Age          22
Height       18
Weight       87
College     118
Salary      309
dtype: int64

### 2) Métodos para modificar la estructura

#### Columnas

In [100]:
data.columns

Index(['Name', 'Team', 'Number', 'Position', 'Age', 'Height', 'Weight',
       'College', 'Salary'],
      dtype='object')

In [102]:
# Podemos asignar otra lista de nombres
data.columns = ['Name', 'Equipo', 'Número', 'Position', 'Age', 'Height', 'Weight','College', 'Salary']

In [104]:
data.head(2)

,Name,Equipo,Número,Position,Age,Height,Weight,College,Salary
0,Avery Bradley,Boston Celtics,0.0,PG,25.0,6-2,180.0,Texas,7730337.0
1,Jae Crowder,Boston Celtics,99.0,SF,25.0,6-6,235.0,Marquette,6796117.0

Podemos utilizar el método rename con un diccionario con la siguiente notación.

```python
df.rename(columns = {nombre_actual:nombre_nuevo}, inplace = True)
```

El argumento `inplace=True` nos permite que se almacene la modificación en el DataFrame.

In [107]:
data.rename(columns = {'Equipo':'Team', 'Número':'Number'}, inplace = True)

In [109]:
data.head(2)

,Name,Team,Number,Position,Age,Height,Weight,College,Salary
0,Avery Bradley,Boston Celtics,0.0,PG,25.0,6-2,180.0,Texas,7730337.0
1,Jae Crowder,Boston Celtics,99.0,SF,25.0,6-6,235.0,Marquette,6796117.0

Si queremos eliminar columnas tenemos dos formas de hacerlo, con el método `drop` o con `del`:

In [112]:
data.drop(labels = ["College"], axis = "columns", inplace = True)

In [114]:
data.head(2)

,Name,Team,Number,Position,Age,Height,Weight,Salary
0,Avery Bradley,Boston Celtics,0.0,PG,25.0,6-2,180.0,7730337.0
1,Jae Crowder,Boston Celtics,99.0,SF,25.0,6-6,235.0,6796117.0

In [65]:
del data['Team']

In [66]:
data.head(2)

            Name  Number Position   Age Height  Weight     Salary
0  Avery Bradley     0.0       PG  25.0    6-2   180.0  7730337.0
1    Jae Crowder    99.0       SF  25.0    6-6   235.0  6796117.0

#### Índices

Podemos cambiar el índice del DataFrame y asginar como índice una columna o varias del mismo:

In [67]:
data.set_index('Name', inplace = True)

In [68]:
data.head()

               Number Position   Age Height  Weight     Salary
Name
Avery Bradley     0.0       PG  25.0    6-2   180.0  7730337.0
Jae Crowder      99.0       SF  25.0    6-6   235.0  6796117.0
John Holland     30.0       SG  27.0    6-5   205.0        NaN
R.J. Hunter      28.0       SG  22.0    6-5   185.0  1148640.0
Jonas Jerebko     8.0       PF  29.0   6-10   231.0  5000000.0

In [69]:
data.index

Index([ 'Avery Bradley',    'Jae Crowder',   'John Holland',    'R.J. Hunter',
        'Jonas Jerebko',   'Amir Johnson',  'Jordan Mickey',   'Kelly Olynyk',
         'Terry Rozier',   'Marcus Smart',
       ...
       'Gordon Hayward',    'Rodney Hood',     'Joe Ingles',  'Chris Johnson',
           'Trey Lyles',   'Shelvin Mack',      'Raul Neto',   'Tibor Pleiss',
          'Jeff Withey',              nan],
      dtype='object', name='Name', length=458)

Podemos revertir la operación:

In [70]:
data.reset_index(inplace = True)

In [71]:
data.head()

            Name  Number Position   Age Height  Weight     Salary
0  Avery Bradley     0.0       PG  25.0    6-2   180.0  7730337.0
1    Jae Crowder    99.0       SF  25.0    6-6   235.0  6796117.0
2   John Holland    30.0       SG  27.0    6-5   205.0        NaN
3    R.J. Hunter    28.0       SG  22.0    6-5   185.0  1148640.0
4  Jonas Jerebko     8.0       PF  29.0   6-10   231.0  5000000.0

In [72]:
data.index

RangeIndex(start=0, stop=458, step=1)

### 3) Métodos para operaciones aritméticas

In [73]:
rev = pd.read_csv("data/revenue.csv", index_col = "Date")
rev.head(3)

        New York  Los Angeles  Miami
Date
1/1/16       985          122    499
1/2/16       738          788    534
1/3/16        14           20    933

In [75]:
rev.sum(axis = 1)

Date
1/1/16     1606
1/2/16     2060
1/3/16      967
1/4/16     2519
1/5/16      438
1/6/16     1935
1/7/16     1234
1/8/16     2313
1/9/16     2623
1/10/16     555
dtype: int64

In [76]:
rev.sum(axis = 0)

New York       5475
Los Angeles    5134
Miami          5641
dtype: int64

In [77]:
rev['Miami'].mean()

564.1